In [60]:
##############################################  Pair Programming Pandas V   #####################################
# En este ejercicio pondremos en práctica los conceptos 
# básicos para juntar varios csv que compartan información.
# Trabajaremos con tres ficheros diferentes:
# El csv que creamos en el ejercicio de pair programming Pandas IV, 
# dónde recordamos eliminamos ciertas columnas que no eran necesarias, 
# y habíamos creado nuevas.


# 📌 NOTA Cuando hagáis la unión considerad que la información que más 
# nos interesa es la del DataFrame que creamos en el apartado anterior,
#  lo cual determinará el tipo de unión.

# Guardad el dataframe nuevo en un csv que usaremos mañana en la clase de pair programming

In [61]:
import pandas as pd
import numpy as np
import os
from os import getcwd

In [62]:
df_tiburones3 = pd.read_csv("../Pandas/03-attacks_new1.csv")
df_tiburones3.head(3)

,Case Number,Unnamed: 0,Year,Type,Country,Area,Location,Activity,Name,Sex,Age,Time,Species,HREF
0,2018.06.25,0,2018.0,Boating,USA,California,"Oceanside, San Diego County",Paddling,Julie Wolfe,F,57,18h00,White shark,http://sharkattackfile.net/spreadsheets/pdf_di...
1,2018.06.18,1,2018.0,Unprovoked,USA,Georgia,"St. Simon Island, Glynn County",Standing,Adyson McNeely,F,11,14h00 -15h00,NaN,http://sharkattackfile.net/spreadsheets/pdf_di...
2,2018.06.09,2,2018.0,Invalid,USA,Hawaii,"Habush, Oahu",Surfing,John Denges,M,48,07h45,NaN,http://sharkattackfile.net/spreadsheets/pdf_di...

In [63]:

# El csv llamado attacks_historico donde tenemos información sobre 
# los ataques de tiburón previos al año 1800, este fichero lo 
# tenéis un poco mas abajo para descargar.

df_tibuhistorico = pd.read_csv("../Pandas/05-attacks_historico.csv", index_col = 0)
df_tibuhistorico.head(3)

,Case Number,Year,Type,Country,Area,Location,Activity,Name,Sex,Age,...,Species,Investigator or Source,pdf,href formula,href,Case Number.1,Case Number.2,original order,Unnamed: 22,Unnamed: 23
6132,1800.00.00,1800.0,Unprovoked,SEYCHELLES,St. Anne,NaN,a corsair's boat was overturned,NaN,F,NaN,...,NaN,V. C. Harvey-Brain,1800.00.00-Corsair-boat.pdf,http://sharkattackfile.net/spreadsheets/pdf_di...,http://sharkattackfile.net/spreadsheets/pdf_di...,1800.00.00,1800.00.00,171.0,NaN,NaN
6133,1797.05.28.R,1797.0,Unprovoked,NaN,NaN,NaN,Dropped overboard,child,NaN,NaN,...,NaN,The Observer 5/28/1797,1797.05.28.R-Cloverdale.pdf,http://sharkattackfile.net/spreadsheets/pdf_di...,http://sharkattackfile.net/spreadsheets/pdf_di...,1797.05.28.R,1797.05.28.R,170.0,NaN,NaN
6134,1792.09.12,1792.0,Provoked,ENGLAND,NaN,On the Thames River,Fishing,male,M,NaN,...,NaN,"The Waterford Herald, 9/15/1792",1792.09.12-Thames.pdf,http://sharkattackfile.net/spreadsheets/pdf_di...,http://sharkattackfile.net/spreadsheets/pdf_di...,1792.09.12,1792.09.12,169.0,NaN,NaN

In [64]:

# El csv llamado attacks_adicional donde tenemos información 
# sobre los ataques de tiburón. de nuevo, 
# este fichero lo tenéis abajo para descargar.


df_tibuadicional = pd.read_csv("../Pandas/05-attacks_adicional.csv", index_col = 0)
df_tibuadicional.head(3)

,Case Number,Fatal (Y/N),Injury,Date
0,2018.06.25,N,"No injury to occupant, outrigger canoe and pad...",25-Jun-2018
1,2018.06.18,N,Minor injury to left thigh,18-Jun-2018
2,2018.06.09,N,Injury to left lower leg from surfboard skeg,09-Jun-2018

In [65]:

# El principal objetivo de este ejercicio de pair programming
#  es acabar teniendo un único DataFrame con toda la información
#  contenida en los tres csv anteriores.
# Para llevar a cabo nuestro objetivo tendréis que seguir los siguientes pasos:
# Cargad los tres ficheros nombrados anteriormente y los exploramos para 
# familizarizarnos con ellos y saber que información tienen en común
#  y debatir con tu compañera como podríamos juntar toda la información.

# Describe

In [66]:
# Chequead que los nombres de las columnas ver si se llaman iguales entre dataframes .

nombre_tibu3_des = df_tiburones3.describe().T
nombre_tibuhistorico_des = df_tibuhistorico.describe().T
nombre_tibuadicional_des = df_tibuadicional.describe().T

In [67]:
nombre_tibu3_des

,count,mean,std,min,25%,50%,75%,max
Unnamed: 0,6114.0,3065.554629,1769.652139,0.0,1534.25,3066.5,4596.75,6131.0
Year,6114.0,1968.831207,43.745920,1801.0,1946.00,1980.0,2005.00,2018.0

In [68]:
nombre_tibuhistorico_des

,count,mean,std,min,25%,50%,75%,max
Year,170.0,428.617647,744.448512,0.0,0.00,0.0,394.25,1800.0
original order,170.0,86.500000,49.218899,2.0,44.25,86.5,128.75,171.0
Unnamed: 22,0.0,NaN,NaN,NaN,NaN,NaN,NaN,NaN
Unnamed: 23,0.0,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [69]:
nombre_tibuadicional_des

            count unique         top  freq
Case Number  6287   6287  2018.06.25     1
Fatal (Y/N)  5751      8           N  4284
Injury       6258   3729       FATAL   801
Date         6286   5431        1957    11

# Columns

In [70]:
nombre_tibu3_col = df_tiburones3.columns
nombre_tibuhistorico_col = df_tibuhistorico.columns
nombre_tibuadicional_col = df_tibuadicional.columns

In [71]:
nombre_tibu3_col

Index(['Case Number', 'Unnamed: 0', 'Year', 'Type', 'Country', 'Area',
       'Location', 'Activity', 'Name', 'Sex ', 'Age', 'Time', 'Species ',
       'HREF'],
      dtype='object')

In [72]:
nombre_tibuhistorico_col

Index(['Case Number', 'Year', 'Type', 'Country', 'Area', 'Location',
       'Activity', 'Name', 'Sex ', 'Age', 'Time', 'Species ',
       'Investigator or Source', 'pdf', 'href formula', 'href',
       'Case Number.1', 'Case Number.2', 'original order', 'Unnamed: 22',
       'Unnamed: 23'],
      dtype='object')

In [73]:
nombre_tibuadicional_col

Index(['Case Number', 'Fatal (Y/N)', 'Injury', 'Date'], dtype='object')

# Shape

In [74]:
nombre_tibu3_shape = df_tiburones3.shape
nombre_tibuhistorico_shape = df_tibuhistorico.shape
nombre_tibuadicional_shape = df_tibuadicional.shape

In [75]:
nombre_tibu3_shape

(6114, 14)

In [76]:
nombre_tibuhistorico_shape

(170, 21)

In [77]:
nombre_tibuadicional_shape

(6288, 4)

# Borrar columnas unnamed

In [78]:
df_tiburones33 = df_tiburones3.drop(["Unnamed: 0"], axis = 1)
df_tiburones33.head(1)

,Case Number,Year,Type,Country,Area,Location,Activity,Name,Sex,Age,Time,Species,HREF
0,2018.06.25,2018.0,Boating,USA,California,"Oceanside, San Diego County",Paddling,Julie Wolfe,F,57,18h00,White shark,http://sharkattackfile.net/spreadsheets/pdf_di...

In [79]:
df_tibuhistorico33 = df_tibuhistorico.drop(["Unnamed: 22", "Unnamed: 23"], axis = 1)
df_tibuhistorico33.head(1)

,Case Number,Year,Type,Country,Area,Location,Activity,Name,Sex,Age,Time,Species,Investigator or Source,pdf,href formula,href,Case Number.1,Case Number.2,original order
6132,1800.00.00,1800.0,Unprovoked,SEYCHELLES,St. Anne,NaN,a corsair's boat was overturned,NaN,F,NaN,NaN,NaN,V. C. Harvey-Brain,1800.00.00-Corsair-boat.pdf,http://sharkattackfile.net/spreadsheets/pdf_di...,http://sharkattackfile.net/spreadsheets/pdf_di...,1800.00.00,1800.00.00,171.0

# Cambiar el nombre a las columnas

In [80]:
lista_columnas_historico = {col: col.strip().replace(" ", "_").lower() for col in df_tibuhistorico33.columns}
df_tibuhistorico33.rename(columns=lista_columnas_historico, inplace=True)

In [81]:
df_tibuhistorico33.head(1)

,case_number,year,type,country,area,location,activity,name,sex,age,time,species,investigator_or_source,pdf,href_formula,href,case_number.1,case_number.2,original_order
6132,1800.00.00,1800.0,Unprovoked,SEYCHELLES,St. Anne,NaN,a corsair's boat was overturned,NaN,F,NaN,NaN,NaN,V. C. Harvey-Brain,1800.00.00-Corsair-boat.pdf,http://sharkattackfile.net/spreadsheets/pdf_di...,http://sharkattackfile.net/spreadsheets/pdf_di...,1800.00.00,1800.00.00,171.0

# Cambiar el nombre a todas las columnas en minusculas y sin espacios delante ni detras

In [82]:

lista_columnas_adicional = {col : col.strip().replace(" ", "_").lower() for col in df_tibuadicional.columns}
df_tibuadicional.rename(columns=lista_columnas_adicional, inplace=True)

In [83]:
df_tibuadicional.head(1)

,case_number,fatal_(y/n),injury,date
0,2018.06.25,N,"No injury to occupant, outrigger canoe and pad...",25-Jun-2018

In [84]:
lista_columnas_tibu3 = {col: col.strip().replace(" ", "_").lower() for col in df_tiburones33.columns}
df_tiburones33.rename(columns=lista_columnas_tibu3, inplace=True)

In [85]:
df_tiburones33.head(1)

,case_number,year,type,country,area,location,activity,name,sex,age,time,species,href
0,2018.06.25,2018.0,Boating,USA,California,"Oceanside, San Diego County",Paddling,Julie Wolfe,F,57,18h00,White shark,http://sharkattackfile.net/spreadsheets/pdf_di...

#  ¿Están todas en minúsculas? 
Si

# ¿Tienen espacios?
No

# En caso de que no sean todas iguales unificad el nombre de las columnas.
Están unificadas

In [86]:

# En este momento nos habremos dado cuenta que el DataFrame que generamos 
# en el pair programming Pandas IV es similar al DataFrame de los datos historicos.
# Si recordamos, eliminamos algunas columnas en la sesión III que no eran útiles,
#  pero esas columnas están todavía en el histórico. Si no fuera por eso podríamos 
# unir esos dataframes. Realizad los cambios que creais necesarios para que los
#  dataframes sean iguales y luego juntadlos usando el mejor método.

In [87]:
df_tiburones33.columns

Index(['case_number', 'year', 'type', 'country', 'area', 'location',
       'activity', 'name', 'sex', 'age', 'time', 'species', 'href'],
      dtype='object')

In [88]:
df_tibuhistorico33.columns

Index(['case_number', 'year', 'type', 'country', 'area', 'location',
       'activity', 'name', 'sex', 'age', 'time', 'species',
       'investigator_or_source', 'pdf', 'href_formula', 'href',
       'case_number.1', 'case_number.2', 'original_order'],
      dtype='object')

Vemos que tienen practicamente los mismo nombres de columnas, por esto usamos concat

In [89]:
# Usamos un concat para unir las dos df que tienen columnas en común:

df_concat = pd.concat([df_tiburones33, df_tibuhistorico], axis = 0)
df_concat.head(2)

,case_number,year,type,country,area,location,activity,name,sex,age,...,Time,Species,Investigator or Source,pdf,href formula,Case Number.1,Case Number.2,original order,Unnamed: 22,Unnamed: 23
0,2018.06.25,2018.0,Boating,USA,California,"Oceanside, San Diego County",Paddling,Julie Wolfe,F,57,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
1,2018.06.18,2018.0,Unprovoked,USA,Georgia,"St. Simon Island, Glynn County",Standing,Adyson McNeely,F,11,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [90]:
# Transformamos case_number a índice para hacer el join con df_tibuadicional, ya que el dato aparece como object.

df_tibuadicional.set_index('case_number',inplace = True)

In [91]:
df_final = df_concat.join(df_tibuadicional, on ='case_number')
df_final.head(2)

,case_number,year,type,country,area,location,activity,name,sex,age,...,pdf,href formula,Case Number.1,Case Number.2,original order,Unnamed: 22,Unnamed: 23,fatal_(y/n),injury,date
0,2018.06.25,2018.0,Boating,USA,California,"Oceanside, San Diego County",Paddling,Julie Wolfe,F,57,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,N,"No injury to occupant, outrigger canoe and pad...",25-Jun-2018
1,2018.06.18,2018.0,Unprovoked,USA,Georgia,"St. Simon Island, Glynn County",Standing,Adyson McNeely,F,11,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,N,Minor injury to left thigh,18-Jun-2018

In [92]:
df_final.columns

Index(['case_number', 'year', 'type', 'country', 'area', 'location',
       'activity', 'name', 'sex', 'age', 'time', 'species', 'href',
       'Case Number', 'Year', 'Type', 'Country', 'Area', 'Location',
       'Activity', 'Name', 'Sex ', 'Age', 'Time', 'Species ',
       'Investigator or Source', 'pdf', 'href formula', 'Case Number.1',
       'Case Number.2', 'original order', 'Unnamed: 22', 'Unnamed: 23',
       'fatal_(y/n)', 'injury', 'date'],
      dtype='object')

In [93]:
df_final.shape

(6284, 36)

In [94]:
# Es el momento de unir la información de todos los ataques de tiburón
#  que acabamos de crear con el DataFrame de información adicional. 
# Debatid que método es el más correcto para unir toda esta información 
# y ejecutadlo.

In [95]:
df_final.to_csv("05-attacks_union.csv")

In [96]:
leer = pd.read_csv("05-attacks_union.csv")
leer.head(2)

,Unnamed: 0,case_number,year,type,country,area,location,activity,name,sex,...,pdf,href formula,Case Number.1,Case Number.2,original order,Unnamed: 22,Unnamed: 23,fatal_(y/n),injury,date
0,0,2018.06.25,2018.0,Boating,USA,California,"Oceanside, San Diego County",Paddling,Julie Wolfe,F,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,N,"No injury to occupant, outrigger canoe and pad...",25-Jun-2018
1,1,2018.06.18,2018.0,Unprovoked,USA,Georgia,"St. Simon Island, Glynn County",Standing,Adyson McNeely,F,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,N,Minor injury to left thigh,18-Jun-2018